---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.AutoRouteFailures.DesignOptionConflictWarning
source: html/22465692-04e2-e5de-3d57-30823ea817bc.htm
---
# Autodesk.Revit.DB.BuiltInFailures.AutoRouteFailures.DesignOptionConflictWarning Property

The solution is failing to do the elements are not in the same Design Option.

## Syntax (C#)
```csharp
public static FailureDefinitionId DesignOptionConflictWarning { get; }
```